---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LightGroup
source: html/fd876292-9f3a-7a90-dd41-019631baadca.htm
---
# Autodesk.Revit.DB.Lighting.LightGroup

This class represents a set of lights grouped together for easier management of various lighting scenarios

## Syntax (C#)
```csharp
public class LightGroup : IDisposable
```